Revit 2027 API
PipePlumbingFixtureFlowData.Flow Property
 The actual flow of the plumbing fixture converted from dimension flow or fixture unit. Units: (gal/min).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Flow { get; set; }
Public Property Flow As Double
	Get
	Set
public:
property double Flow {
	double get ();
	void set (double value);
}
member Flow : float with get, set
Property Value
Double
See Also
Reference
PipePlumbingFixtureFlowData Class
Autodesk.Revit.DB.Plumbing Namespace